redisTestResult/redisMutiThreadsTestResultOnHost1/redis_test_result_by_memtier_benchmark_F_OFF_3nd/redis_result_Gauss82_F_OFF_P7_3nd20230719005737.log
20        Threads
5         Connections per thread
50        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         5813.79          ---          ---         3.44119         3.35900         6.75100        11.90300      6279.35 
Gets        23247.39     22235.34      1012.05         3.43600         3.32700         6.71900        11.77500     23979.48 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      29061.18     22235.34      1012.05         3.43704         3.32700         6.71900        11.83900     30258.83 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.303        0.000
SET       3.039        5.000
SET       3.135       10.000
SET       3.183       15.000
SET       3.215       20.000
SET       3.247       25.000
SET       3.263       30.000
SET       3.295       35.000
SET       3.311       40.000
SET       3.327       45.000
SET       3.359       50.000
SET       3.359       52.500
SET       3.375       55.000
SET       3.391       57.500
SET       3.407       60.000
SET       3.423       62.500
SET       3.423       65.000
SET       3.439       67.500
SET       3.455       70.000
SET       3.471       72.500
SET       3.487       75.000
SET       3.487       76.250
SET       3.503       77.500
SET       3.503       78.750
SET       3.519       80.000
SET       3.519       81.250
SET       3.535       82.500
SET       3.535       83.750
SET       3.551       85.000
SET       3.551       86.250
SET       3.567       87.500
SET       3.583       88.125
SET       3.583       88.750
SET       3.583       89.375
SET       3.599       90.000
SET       3.599       90.625
SET       3.615       91.250
SET       3.615       91.875
SET       3.631       92.500
SET       3.631       93.125
SET       3.647       93.750
SET       3.647       94.062
SET       3.663       94.375
SET       3.663       94.688
SET       3.679       95.000
SET       3.695       95.312
SET       3.695       95.625
SET       3.711       95.938
SET       3.727       96.250
SET       3.759       96.562
SET       3.791       96.875
SET       3.823       97.031
SET       3.855       97.188
SET       3.919       97.344
SET       4.383       97.500
SET       5.759       97.656
SET       6.175       97.812
SET       6.335       97.969
SET       6.431       98.125
SET       6.495       98.281
SET       6.559       98.438
SET       6.591       98.516
SET       6.591       98.594
SET       6.623       98.672
SET       6.655       98.750
SET       6.687       98.828
SET       6.719       98.906
SET       6.751       98.984
SET       6.783       99.062
SET       6.815       99.141
SET       6.879       99.219
SET       6.879       99.258
SET       6.911       99.297
SET       6.943       99.336
SET       6.943       99.375
SET       6.975       99.414
SET       7.007       99.453
SET       7.007       99.492
SET       7.039       99.531
SET       7.071       99.570
SET       7.071       99.609
SET       7.103       99.629
SET       7.103       99.648
SET       7.135       99.668
SET       7.135       99.688
SET       7.167       99.707
SET       7.167       99.727
SET       7.199       99.746
SET       7.231       99.766
SET       7.263       99.785
SET       7.295       99.805
SET       7.327       99.814
SET       7.391       99.824
SET       7.487       99.834
SET       9.471       99.844
SET      10.239       99.854
SET      10.367       99.863
SET      11.711       99.873
SET      11.775       99.883
SET      11.839       99.893
SET      11.903       99.902
SET      11.967       99.907
SET      11.967       99.912
SET      11.967       99.917
SET      11.967       99.922
SET      12.031       99.927
SET      12.031       99.932
SET      12.031       99.937
SET      12.095       99.941
SET      12.095       99.946
SET      12.159       99.951
SET      12.223       99.954
SET      12.223       99.956
SET      12.223       99.958
SET      12.287       99.961
SET      12.351       99.963
SET      15.231       99.966
SET      15.999       99.968
SET      22.015       99.971
SET      22.143       99.973
SET      22.143       99.976
SET      22.143       99.977
SET      22.143       99.978
SET      22.143       99.979
SET      22.143       99.980
SET      22.143       99.982
SET      22.271       99.983
SET      22.271       99.984
SET      22.271       99.985
SET      22.271       99.987
SET      22.271       99.988
SET      22.271       99.988
SET      22.271       99.989
SET      22.271       99.990
SET      22.271       99.990
SET      22.271       99.991
SET      22.271       99.991
SET      22.271       99.992
SET      22.271       99.993
SET      22.271       99.993
SET      22.271       99.994
SET      22.399       99.994
SET      22.399       99.995
SET      22.399       99.995
SET      22.399       99.995
[...]
SET      22.399       99.996
SET      22.399       99.996
SET      22.399       99.996
SET      22.399       99.997
SET      22.399       99.997
SET      22.399       99.997
[...]
SET      22.399       99.998
SET      22.399       99.998
SET      22.399       99.998
[...]
SET      25.727       99.998
SET      25.727       99.998
SET      25.727       99.999
SET     622.591       99.999
SET     622.591       99.999
SET     622.591       99.999
[...]
SET     622.591      100.000
SET     622.591      100.000
SET     622.591      100.000
[...]
SET     626.687      100.000
SET     626.687      100.000
---
GET       1.135        0.000
GET       2.911        5.000
GET       3.071       10.000
GET       3.151       15.000
GET       3.183       20.000
GET       3.215       25.000
GET       3.247       30.000
GET       3.263       35.000
GET       3.279       40.000
GET       3.311       45.000
GET       3.327       50.000
GET       3.343       52.500
GET       3.359       55.000
GET       3.359       57.500
GET       3.375       60.000
GET       3.391       62.500
GET       3.407       65.000
GET       3.423       67.500
GET       3.439       70.000
GET       3.455       72.500
GET       3.455       75.000
GET       3.471       76.250
GET       3.471       77.500
GET       3.487       78.750
GET       3.487       80.000
GET       3.503       81.250
GET       3.503       82.500
GET       3.519       83.750
GET       3.535       85.000
GET       3.535       86.250
GET       3.551       87.500
GET       3.551       88.125
GET       3.551       88.750
GET       3.567       89.375
GET       3.567       90.000
GET       3.583       90.625
GET       3.583       91.250
GET       3.583       91.875
GET       3.599       92.500
GET       3.615       93.125
GET       3.615       93.750
GET       3.631       94.062
GET       3.631       94.375
GET       3.631       94.688
GET       3.647       95.000
GET       3.647       95.312
GET       3.663       95.625
GET       3.663       95.938
GET       3.679       96.250
GET       3.695       96.562
GET       3.711       96.875
GET       3.727       97.031
GET       3.743       97.188
GET       3.775       97.344
GET       3.855       97.500
GET       4.607       97.656
GET       5.919       97.812
GET       6.207       97.969
GET       6.367       98.125
GET       6.431       98.281
GET       6.495       98.438
GET       6.527       98.516
GET       6.559       98.594
GET       6.591       98.672
GET       6.623       98.750
GET       6.655       98.828
GET       6.687       98.906
GET       6.719       98.984
GET       6.751       99.062
GET       6.783       99.141
GET       6.815       99.219
GET       6.847       99.258
GET       6.847       99.297
GET       6.879       99.336
GET       6.911       99.375
GET       6.943       99.414
GET       6.943       99.453
GET       6.975       99.492
GET       7.007       99.531
GET       7.039       99.570
GET       7.071       99.609
GET       7.071       99.629
GET       7.071       99.648
GET       7.103       99.668
GET       7.103       99.688
GET       7.135       99.707
GET       7.135       99.727
GET       7.167       99.746
GET       7.199       99.766
GET       7.231       99.785
GET       7.263       99.805
GET       7.295       99.814
GET       7.327       99.824
GET       7.391       99.834
GET       7.487       99.844
GET       8.383       99.854
GET       9.983       99.863
GET      10.367       99.873
GET      11.647       99.883
GET      11.775       99.893
GET      11.839       99.902
GET      11.839       99.907
GET      11.839       99.912
GET      11.903       99.917
GET      11.903       99.922
GET      11.903       99.927
GET      11.903       99.932
GET      11.967       99.937
GET      11.967       99.941
GET      11.967       99.946
GET      11.967       99.951
GET      12.031       99.954
GET      12.031       99.956
GET      12.031       99.958
GET      12.031       99.961
GET      12.095       99.963
GET      12.095       99.966
GET      12.095       99.968
GET      12.095       99.971
GET      12.159       99.973
GET      12.223       99.976
GET      12.223       99.977
GET      12.223       99.978
GET      12.223       99.979
GET      12.287       99.980
GET      12.287       99.982
GET      12.287       99.983
GET      12.351       99.984
GET      12.351       99.985
GET      14.015       99.987
GET      15.167       99.988
GET      15.295       99.988
GET      15.295       99.989
GET      15.359       99.990
GET      15.487       99.990
GET      22.015       99.991
GET      22.527       99.991
GET     622.591       99.992
GET     622.591       99.993
GET     622.591       99.993
GET     622.591       99.994
GET     622.591       99.994
GET     622.591       99.995
GET     622.591       99.995
GET     622.591       99.995
[...]
GET     622.591       99.996
GET     622.591       99.996
GET     622.591       99.996
GET     622.591       99.997
GET     622.591       99.997
GET     622.591       99.997
[...]
GET     622.591       99.998
GET     622.591       99.998
GET     622.591       99.998
[...]
GET     622.591       99.999
GET     622.591       99.999
GET     622.591       99.999
[...]
GET     622.591      100.000
GET     622.591      100.000
GET     622.591      100.000
[...]
GET     626.687      100.000
GET     626.687      100.000
---
WAIT      0.000      100.000